gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Mettre à jour tous les paramètres existants (0-23)        
  parameters[0].value = autopan_depth;        
  parameters[1].value = pitch;        
  parameters[2].value = vibrato_speed;        
  parameters[3].value = vibrato_depth;        
  parameters[4].value = delay_time;        
  parameters[5].value = delay_feedback;        
  parameters[6].value = osc_waveform;        
  parameters[7].value = gate_threshold;        
  parameters[8].value = portamento_time;        
  parameters[9].value = scale;        
  parameters[10].value = octave_low_high;        
  parameters[11].value = osc2_volume;        
  parameters[12].value = osc2_pitch_offset;        
  parameters[13].value = autopan_frequency;        
  parameters[14].value = scale_tonic;        
  parameters[15].value = volume_drums;        
  parameters[16].value = trig_kick;        
  parameters[17].value = trig_snare;        
  parameters[18].value = trig_hh;        
  parameters[19].value = master_volume;        
  parameters[20].value = filter_on_off;        
  parameters[21].value = filter_cutoff;        
  parameters[22].value = filter_reso;        
  parameters[23].value = filter_type;        
          
  // Mettre à jour les nouveaux paramètres (24-39)        
  parameters[24].value = ir1_target_param;        
  parameters[25].value = ir2_target_param;        
  parameters[26].value = fader1_target_param;        
  parameters[27].value = fader2_target_param;        
  parameters[28].value = fader3_target_param;        
  parameters[29].value = button3_target_param;        
  parameters[30].value = button3_released_value;        
  parameters[31].value = button3_pressed_value;        
  parameters[32].value = rgb1_red;        
  parameters[33].value = rgb1_green;        
  parameters[34].value = rgb1_blue;        
  parameters[35].value = rgb2_red;        
  parameters[36].value = rgb2_green;        
  parameters[37].value = rgb2_blue;        
  parameters[38].value = dimmer1_source;        
  parameters[39].value = dimmer2_source;        
          
  // Mettre à jour le tableau DMX        
  for (int i = 0; i < PRESET_SIZE; i++) {        
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;        
  }        
          
  //Serial.println("Tous les paramètres mis à jour");        
  printParameters();        
}        
        
// Fonction pour afficher tous les presets disponibles        
void printAllPresets() {        
  //Serial.println("=== Presets disponibles ===");        
  for (int i = 0; i < MAX_PRESETS; i++) {        
    //Serial.print("Preset " + String(i) + ": " + String(presets[i].name));        
    //Serial.println(" (valeurs: " + String(presets[i].values[0]) + "," + String(presets[i].values[1]) + ",...)");        
  }        
  //Serial.println("===========================");        
}        
        
        
        
// Fonction pour lire et stabiliser un capteur IR        
int readStabilizedIRSensor(int sensorPin, int* buffer, int& index, int& sum, bool& initialized) {        
  // Lecture brute        
  int rawValue = analogRead(sensorPin);        
          
  // Application du filtre de stabilisation        
  int stabilizedValue = stabilizeIRSensor(rawValue, buffer, index, sum, initialized);        
          
  return stabilizedValue;        
}        
        
// Fonction pour mapping amélioré d'IR1 (pitch)        
uint8_t mapIR1Logarithmic(int rawValue) {        
  // Normaliser la valeur d'entrée (0-4095 à 0.0-1.0)        
  float normalized = (float)rawValue / 4095.0;        
          
  // Mapping exponentiel inverse pour plus de contrôle dans les petites distances        
  // x^0.3 donne une courbe qui monte rapidement au début puis se stabilise        
  float expMapped = pow(normalized, 0.3);        
          
  // Convertir en 0-255        
  uint8_t result = (uint8_t)(expMapped * 255.0);        
          
  return result;        
}        
        
// Fonction pour mapping linéaire d'IR1 (dimmer)        
uint8_t mapIR1Linear(int rawValue) {        
  // Mapping linéaire simple pour les dimmers        
  return rawValue / 16; // 0-4095 à 0-255        
}        
        
// Fonction pour lire la valeur d'un contrôle assigné (0-4)        
uint8_t getControlValue(uint8_t source) {        
  switch(source) {        
    case 0: // IR1 (mapping linéaire pour dimmer)        
      return mapIR1Linear(readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1));        
    case 1: // IR2        
      return readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2) / 16;        
    case 2: // Fader1 (inversé)        
      return (4095 - analogRead(FADER_1_PIN)) / 16;        
    case 3: // Fader2 (inversé)        
      return (4095 - analogRead(FADER_2_PIN)) / 16;        
    case 4: // Fader3 (inversé)        
      return (4095 - analogRead(FADER_3_PIN)) / 16;        
    default:        
      return 0;        
  }        
}        
        
// Fonction pour mettre à jour le dimmer RGB avec inertie        
void updateRGBWithDimmer() {        
  // En mode web, utiliser les valeurs RGB du preset web courant        
  uint8_t rgb1Red, rgb1Green, rgb1Blue, rgb2Red, rgb2Green, rgb2Blue;        
        
    // Lecture des sources des dimmers depuis les paramètres        
    uint8_t dimmer1Source = getParameter("dimmer1_source");        
    uint8_t dimmer2Source = getParameter("dimmer2_source");        
    uint8_t control1Value;        
    uint8_t control2Value;        
            
            
          
  if (selectedPreset == 0 && webModeActive) {        
    // Mode web : utiliser les valeurs RGB de l'interface web (paramètres 24-26)        
    rgb1Red = parameters[24].value;    // rgb1_red        
    rgb1Green = parameters[25].value;  // rgb1_green        
    rgb1Blue = parameters[26].value;   // rgb1_blue        
    // Pour RGB2, utiliser les mêmes valeurs RGB que RGB1 en mode web        
    rgb2Red = parameters[24].value;        
    rgb2Green = parameters[25].value;        
    rgb2Blue = parameters[26].value;        
        
    control1Value = getControlValue(0); // IR1        
    control2Value = control1Value;        
  } else {        
    // Mode boîtier : utiliser les valeurs RGB des paramètres du preset        
    rgb1Red = getParameter("rgb1_red");        
    rgb1Green = getParameter("rgb1_green");        
    rgb1Blue = getParameter("rgb1_blue");        
    rgb2Red = getParameter("rgb2_red");        
    rgb2Green = getParameter("rgb2_green");        
    rgb2Blue = getParameter("rgb2_blue");        
        
    // Lecture des valeurs des contrôles assignés        
    control1Value = getControlValue(dimmer1Source);        
    control2Value = getControlValue(dimmer2Source);        
  }        
          
        
          
