gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Mapping 50-255 à 0-255 (en dessous de 50 = éteint)        
  float rawDimmer1 = (float)control1Value / 255.0;        
  float rawDimmer2 = (float)control2Value / 255.0;        
          
  float targetDimmer1 = (rawDimmer1 < 0.196) ? 0.0 : (rawDimmer1 - 0.196) / (1.0 - 0.196); // 50/255 Γëê 0.196        
  float targetDimmer2 = (rawDimmer2 < 0.196) ? 0.0 : (rawDimmer2 - 0.196) / (1.0 - 0.196);        
          
  // Application de l'inertie        
  dimmerValue1 += (targetDimmer1 - dimmerValue1) * DIMMER_SPEED;        
  dimmerValue2 += (targetDimmer2 - dimmerValue2) * DIMMER_SPEED;        
          
  // Calcul des valeurs RGB dimmées        
  rgb1RedDimmed = (uint8_t)(rgb1Red * dimmerValue2); // Dimmer2 contrôle DMX RGB        
  rgb1GreenDimmed = (uint8_t)(rgb1Green * dimmerValue2);        
  rgb1BlueDimmed = (uint8_t)(rgb1Blue * dimmerValue2);        
          
  rgb2RedDimmed = (uint8_t)(rgb2Red * dimmerValue1); // Dimmer1 contrôle LED strip        
  rgb2GreenDimmed = (uint8_t)(rgb2Green * dimmerValue1);        
  rgb2BlueDimmed = (uint8_t)(rgb2Blue * dimmerValue1);        
          
  // Debug RGB supprimé pour optimiser les performances
  
  // IMPORTANT: Mettre à jour le ruban LED avec les couleurs calculées
  for (int i = 0; i < NUM_LEDS; i++) {        
    leds[i] = CRGB(rgb2RedDimmed, rgb2GreenDimmed, rgb2BlueDimmed);        
  }        
  FastLED.show();        
}        
        
        
        
// Fonction pour contrôler les paramètres via les entrées physiques         
// Les liens des contrôles sont maintenant lus dynamiquement depuis le preset actuel         
// Si un paramètre de lien vaut 0, le contrôle correspondant est désactivé         
void handlePhysicalControls() {        
  // Vérifier si on est en mode web (preset 0)        
  if (selectedPreset == 0) {        
    webModeActive = true;        
    handleWebPhysicalControls();        
    return; // IMPORTANT: Arrêter complètement l'exécution ici        
  } else {        
    webModeActive = false;        
  }        
          
  // Lecture stabilisée des capteurs IR        
  int stabilizedIR1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);        
  int stabilizedIR2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);        
  uint8_t ir1Value = mapIR1Logarithmic(stabilizedIR1); // Mapping amélioré pour IR1        
  uint8_t ir2Value = stabilizedIR2 / 16; // 0-4095 à 0-255        
          
  // Lecture des faders (inversés : 4095-0 à 0-255)        
  //uint8_t fader1Value = (4095 - analogRead(FADER_1_PIN)) / 16; // 4095-0 à 0-255        
  uint8_t fader1Value = 0; // fader1 cassé, on le remplace par 0 en attendant de le réparer        
  uint8_t fader2Value = (4095 - analogRead(FADER_2_PIN)) / 16;        
  uint8_t fader3Value = (4095 - analogRead(FADER_3_PIN)) / 16;        
          
  // Le bouton 3 a maintenant une nouvelle fonction (mute/clic long) 
  // Il n'est plus géré ici mais dans handleButtons()
          
  // Lire les liens des contrôles directement depuis le preset actuel        
  uint8_t ir1TargetParam = getParameter("ir1_target_param");        
  uint8_t ir2TargetParam = getParameter("ir2_target_param");        
  uint8_t fader1TargetParam = getParameter("fader1_target_param");        
  uint8_t fader2TargetParam = getParameter("fader2_target_param");        
  uint8_t fader3TargetParam = getParameter("fader3_target_param");        
          
  // Appliquer les valeurs aux paramètres cibles selon les liens du preset        
  if (ir1TargetParam >= 0 && ir1TargetParam < PRESET_SIZE) {        
    setParameter(parameters[ir1TargetParam].name, ir1Value);        
  }        
          
  if (ir2TargetParam >= 0 && ir2TargetParam < PRESET_SIZE) {        
    setParameter(parameters[ir2TargetParam].name, ir2Value);        
  }        
          
      if (fader1TargetParam >= 0 && fader1TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader1TargetParam].name, fader1Value);        
    }        
            
    if (fader2TargetParam >= 0 && fader2TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader2TargetParam].name, fader2Value);        
    }        
            
    if (fader3TargetParam >= 0 && fader3TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader3TargetParam].name, fader3Value);        
    }        
        
        
  
          
  // Le bouton 3 n'est plus géré ici - voir handleButtons() pour sa nouvelle fonction        
          
  // Mettre à jour le dimmer RGB        
  updateRGBWithDimmer();        
          
    // Debug (optionnel)        
  static unsigned long lastDebugTime = 0;
}

/*Paramètres Ksoloti        
1 autopan depth        
2 pitch        
3 vibrato speed        
4 vibrato depth        
5 delay time        
6 delay feedback        
7 osc waveform        
8 gate threshold        
9 portamento time        
10 scale        
11 octave low high        
12 OSC 2 volume        
13 OSC 2 pitch offset        
14 autopan frequency        
15 scale tonic        
16 volume drums        
17 trig kick        
18 trig snare        
19 trig hh        
20 master volume (inverted)        
21 filter on-off         
22 filter cutoff        
23 filter reso        
24 filter type        
*/        
// Fonction d'initialisation des presets        
void initializePresets() {        
        
/*        
Targets : (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)        
        
0  = autopan_depth           10  = octave_low_high         20 = filter_on_off            30 = button3_released_value        
1  = pitch                   11 = osc2_volume              21 = filter_cutoff            31 = button3_pressed_value        
2  = vibrato_speed           12 = osc2_pitch_offset        22 = filter_reso              32 = rgb1_red        
3  = vibrato_depth           13 = autopan_frequency        23 = filter_type              33 = rgb1_green        
4  = delay_time              14 = scale_tonic              24 = ir1_target_param         34 = rgb1_blue        
5  = delay_feedback          15 = volume_drums             25 = ir2_target_param         35 = rgb2_red        
6  = osc_waveform            16 = trig_kick                26 = fader1_target_param      36 = rgb2_green        
7  = gate_threshold          17 = trig_snare               27 = fader2_target_param      37 = rgb2_blue        
8  = portamento_time         18 = trig_hh                  28 = fader3_target_param      38 = dimmer1_source        
9  = scale                   19 = master_volume            29 = button3_target_param     39 = dimmer2_source        
*/        
  Serial.println("Initialisation des presets...");        
        
