gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Mute/Unmute (clic court) ou changement de preset (clic long)");        
  Serial.println("Encodeur: Changer preset (rotation) ou octave (clic)");        
  Serial.println("Ruban LED: Feedback visuel des capteurs IR et faders");        
          
  Serial.println("=== MODE STANDALONE INITIALISÉ ===");        
  Serial.println("Interface web: DÉSACTIVÉE");        
  Serial.println("ESP-NOW: ACTIVÉ");        
  Serial.println("Le système est prêt à fonctionner en mode standalone");        
}

// === MODE WIFI LOCAL (AVEC INTERFACE WEB) ===
void setup_wifi_local() {
  Serial.println("=== MODE WIFI LOCAL ACTIVÉ ===");
  currentOperatingMode = MODE_WIFI_LOCAL;
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // FastLED déjà initialisé dans setup()        
          
  // Initialiser l'afficheur TM1637        
  display.setBrightness(7); // Luminosité maximale        
  Serial.println("Afficheur TM1637 initialisé");        
          
  // Initialiser l'encodeur rotatif        
  encoder.attachSingleEdge(ENCODER_A_PIN, ENCODER_B_PIN);        
  encoder.setCount(0);        
  Serial.println("Encodeur rotatif initialisé");        
          
  // Configuration des pins pour les boutons        
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);        
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);        
  Serial.println("Boutons configurés");        
          
  // Initialiser ESP-NOW        
  WiFi.mode(WIFI_STA);        
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur lors de l'initialisation d'ESP-NOW");        
    return;        
  }        
          
  // Enregistrer la fonction de callback pour ESP-NOW        
  esp_now_register_send_cb(OnDataSent);        
          
  // Ajouter le peer (récepteur ksoloti)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur lors de l'ajout du peer");        
    return;        
  }        
          
  Serial.println("ESP-NOW initialisé avec succès");        
          
  // Initialiser les paramètres par défaut        
  initializeParameters();        
          
  // Initialiser les presets        
  initializePresets();        
          
  // Initialiser l'interface utilisateur        
  initializeUserInterface();        
          
  // Initialiser le système unifié des presets web        
  webModeActive = true;        
  selectedPreset = 0; // Toujours en mode web        
  selectedWebPreset = 1; // Commencer avec P1 sélectionné        
  displayUnified(); // Afficher l'état initial        
          
  Serial.println("🎯 Système unifié activé - Utilisation exclusive des web presets");        
  Serial.print("🎵 Octave actuelle: ");        
  Serial.println(webOctave);        
  Serial.print("📋 Preset sélectionné: P");        
  Serial.println(selectedWebPreset);        
          
  // IMPORTANT: Charger le preset P1 par défaut au démarrage
  loadWebPresetUnified(0); // Charger P1 (index 0)
  Serial.println("🚀 Preset P1 chargé par défaut");
          
  // Configuration du serveur web (WiFi Local)        
  setupWebInterface();        
          
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Mute/Unmute (clic court) ou changement de preset (clic long)");        
  Serial.println("Encodeur: Changer preset (rotation) ou octave (clic)");        
  Serial.println("Ruban LED: Feedback visuel des capteurs IR et faders");        
          
  Serial.println("=== MODE WIFI LOCAL INITIALISÉ ===");        
  Serial.println("Interface web: ACTIVÉE (WiFi Local)");        
  Serial.println("ESP-NOW: ACTIVÉ");        
  Serial.println("Le système est prêt à fonctionner en mode WiFi local");        
}

// === MODE WIFI ESP (POINT D'ACCÈS) ===
void setup_wifi_esp() {
  Serial.println("=== MODE WIFI ESP ACTIVÉ ===");
  currentOperatingMode = MODE_WIFI_ESP;
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // FastLED déjà initialisé dans setup()        
          
  // Initialiser l'afficheur TM1637        
  display.setBrightness(7); // Luminosité maximale        
  Serial.println("Afficheur TM1637 initialisé");        
          
  // Initialiser l'encodeur rotatif        
  encoder.attachSingleEdge(ENCODER_A_PIN, ENCODER_B_PIN);        
  encoder.setCount(0);        
  Serial.println("Encodeur rotatif initialisé");        
          
  // Configuration des pins pour les boutons        
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);        
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);        
  Serial.println("Boutons configurés");        
          
  // Initialiser ESP-NOW        
  WiFi.mode(WIFI_STA);        
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur lors de l'initialisation d'ESP-NOW");        
    return;        
  }        
          
