gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Enregistrer la fonction de callback pour ESP-NOW        
  esp_now_register_send_cb(OnDataSent);        
          
  // Ajouter le peer (récepteur ksoloti)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur lors de l'ajout du peer");        
    return;        
  }        
          
  Serial.println("ESP-NOW initialisé avec succès");        
          
  // Initialiser les paramètres par défaut        
  initializeParameters();        
          
  // Initialiser les presets        
  initializePresets();        
          
  // Initialiser l'interface utilisateur        
  initializeUserInterface();        
          
  // Initialiser le système unifié des presets web        
  webModeActive = true;        
  selectedPreset = 0; // Toujours en mode web        
  selectedWebPreset = 1; // Commencer avec P1 sélectionné        
  displayUnified(); // Afficher l'état initial        
          
  Serial.println("🎯 Système unifié activé - Utilisation exclusive des web presets");        
  Serial.print("🎵 Octave actuelle: ");        
  Serial.println(webOctave);        
  Serial.print("📋 Preset sélectionné: P");        
  Serial.println(selectedWebPreset);      
    
          
  // IMPORTANT: Charger le preset P1 par défaut au démarrage
  loadWebPresetUnified(0); // Charger P1 (index 0)
  Serial.println("🚀 Preset P1 chargé par défaut");
          
  // Configuration du serveur web (WiFi ESP - Point d'accès)        
  setupWebInterfaceESP();        
          
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Mute/Unmute (clic court) ou changement de preset (clic long)");        
  Serial.println("Encodeur: Changer preset (rotation) ou octave (clic)");        
  Serial.println("Ruban LED: Feedback visuel des capteurs IR et faders");        
          
  Serial.println("=== MODE WIFI ESP INITIALISÉ ===");        
  Serial.println("Interface web: ACTIVÉE (Point d'accès ESP)");        
  Serial.println("ESP-NOW: ACTIVÉ");        
  Serial.println("Le système est prêt à fonctionner en mode WiFi ESP");        
}

void setup()        
{        
  Serial.begin(115200);        
  Serial.println("=== Contrôleur Interactif ESP32 ===");        
  Serial.print("Version: ");
  Serial.println(VERSION);
  Serial.println("Initialisation...");        
          
  // === VÉRIFICATION DU MODE DE DÉMARRAGE ===        
  Serial.println("Vérification du mode de démarrage...");        
  
  // Configuration des boutons
  pinMode(BUTTON_1_PIN, INPUT_PULLUP); // GPIO22 - OTA
  pinMode(BUTTON_2_PIN, INPUT_PULLUP); // GPIO21 - Mode WiFi
  delay(100); // Attendre la stabilisation
  
  // Initialiser FastLED pour les indicateurs de mode
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);        
  FastLED.setBrightness(BRIGHTNESS);        
  Serial.println("Ruban LED initialisé pour les indicateurs de mode");
  
  // Vérifier si le bouton 1 est pressé au démarrage (Mode OTA)
  bool button1Pressed = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP
  Serial.print("État du bouton 1 au démarrage: ");
  Serial.println(button1Pressed ? "PRESSÉ" : "RELAXÉ");
  
  if (button1Pressed) {
    setup_OTA(); // Cette fonction termine par un redémarrage
    return; // Ne jamais atteint car setup_OTA() redémarre
  }
  
  // Vérifier le bouton 2 pour les modes WiFi
  bool button2Pressed = !digitalRead(BUTTON_2_PIN); // Inversé car INPUT_PULLUP
  Serial.print("État du bouton 2 au démarrage: ");
  Serial.println(button2Pressed ? "PRESSÉ" : "RELAXÉ");
  
  // === NOUVELLE LOGIQUE DE SÉLECTION ===
  Serial.println("Début de la sélection du mode...");
  
  // Étape 1: Clignotement rose pendant 2 secondes (évaluation en cours)
  Serial.println("Indicateur LED: Évaluation en cours (Rose)");
  for (int blink = 0; blink < 20; blink++) { // 2 secondes = 20 x 100ms
    for (int i = 0; i < NUM_LEDS; i++) {
      leds[i] = CRGB::Magenta; // Rose/Magenta
    }
    FastLED.show();
    delay(100);
    FastLED.clear();
    FastLED.show();
    delay(100);
  }
  
  // Étape 2: Évaluation du bouton après le clignotement rose
  bool buttonStillPressed = !digitalRead(BUTTON_2_PIN);
  Serial.print("État du bouton 2 après clignotement rose: ");
  Serial.println(buttonStillPressed ? "PRESSÉ" : "RELAXÉ");
  
  if (!buttonStillPressed) {
    // Bouton relâché → Mode Standalone
    Serial.println("Bouton relâché - Mode Standalone");
    addDebugMessage("Bouton relâché - Mode Standalone");
    setup_standalone();
    return;
  }
  
  // Bouton encore pressé → Clignotement cyan (Mode WiFi Local)
  Serial.println("Bouton encore pressé - Clignotement cyan (Mode WiFi Local)");
  addDebugMessage("Bouton encore pressé - Clignotement cyan (Mode WiFi Local)");
  for (int blink = 0; blink < 20; blink++) { // 2 secondes = 20 x 100ms
    for (int i = 0; i < NUM_LEDS; i++) {
      leds[i] = CRGB::Cyan;
    }
    FastLED.show();
    delay(100);
    FastLED.clear();
    FastLED.show();
    delay(100);
  }
  
  // Étape 3: Évaluation finale du bouton après le clignotement cyan
  bool buttonStillPressedFinal = !digitalRead(BUTTON_2_PIN);
  Serial.print("État du bouton 2 après clignotement cyan: ");
  Serial.println(buttonStillPressedFinal ? "PRESSÉ" : "RELAXÉ");
  
  if (!buttonStillPressedFinal) {
    // Bouton relâché → Mode WiFi Local
    Serial.println("Bouton relâché - Mode WiFi Local");
    addDebugMessage("Bouton relâché - Mode WiFi Local");
    setup_wifi_local();
    return;
  }
  
  // Bouton encore pressé → Clignotement jaune et Mode WiFi ESP
  Serial.println("Bouton encore pressé - Clignotement jaune (Mode WiFi ESP)");
  addDebugMessage("Bouton encore pressé - Clignotement jaune (Mode WiFi ESP)");
  for (int blink = 0; blink < 20; blink++) { // 2 secondes = 20 x 100ms
    for (int i = 0; i < NUM_LEDS; i++) {
      leds[i] = CRGB::Yellow;
    }
    FastLED.show();
    delay(100);
    FastLED.clear();
    FastLED.show();
    delay(100);
  }
  
  // Mode WiFi ESP
  Serial.println("Mode WiFi ESP confirmé");
  addDebugMessage("Mode WiFi ESP confirmé");
  setup_wifi_esp();
  return;
}        
        
void sendDMXvalues()        
{        
  // Appliquer les overrides avant l'envoi
  uint8_t originalMasterVolume = dmxValues[119]; // Canal DMX 120 (master_volume)
  uint8_t originalDelayFeedback = dmxValues[105]; // Canal DMX 106 (delay_feedback)
  
  // Override du master volume en mode mute (255 = mute car volume inversé)
  if (muteMode) {
    dmxValues[119] = 255;
  }
  
  // Override du delay feedback en clic long (255 = maximum)
  if (button3LongPress) {
    dmxValues[105] = 255;
  }
        
