gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Lecture des faders        
 // readFaders();        
          
  // Gestion des boutons push        
  handleButtonInterrupts();
  handleButtons();  // Gestion du bouton 3 (mute/unmute et clic long)
          
  // Gestion du serveur web (limité à 10Hz pour éviter la surcharge)        
  // Seulement si l'interface web est activée (modes WiFi Local ou WiFi ESP)
  if (currentOperatingMode != MODE_STANDALONE) {
    static unsigned long lastWebServerUpdate = 0;        
    if (millis() - lastWebServerUpdate >= 100) { // 100ms = 10Hz        
      webServer.handleClient();        
      lastWebServerUpdate = millis();        
    }        
  }        
          
  // Gestion de l'encodeur KY-040        
 // handleEncoder();        
          
  // Mise à jour de l'afficheur TM1637        
  updateDisplay();        
          
  // Émission à fréquence fixe (50Hz)        
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {        
            
    setlights();        
    sendDMXvalues();        
    lastEmissionTime = millis();        
  }        
          
  delay(1); // Petit délai pour éviter de surcharger le CPU        
}        
        
// ============================================================================        
// IMPLÉMENTATION DES FONCTIONS DE L'INTERFACE WEB        
// ============================================================================        
        
// Initialisation du système de fichiers et du serveur web        
void setupWebInterface() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      return;        
    }        
  }        
  Serial.println("LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println(" Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println(" Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
  // Configuration WiFiManager
  Serial.println("Configuration WiFiManager...");
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT_MS / 1000); // Convertir en secondes
  wifiManager.setAPCallback([](WiFiManager *myWiFiManager) {
    Serial.println("Portail de configuration WiFi démarré");
    Serial.print("SSID: ");
    Serial.println(myWiFiManager->getConfigPortalSSID());
    Serial.print("IP: ");
    Serial.println(WiFi.softAPIP());
  });
  
  // Tentative de connexion au WiFi
  Serial.println("Tentative de connexion au WiFi...");
  if (!wifiManager.autoConnect("KsolotiKontrol-Config")) {
    Serial.println("Échec de la connexion WiFi et timeout du portail de configuration");
    Serial.println("Redémarrage de l'ESP32...");
    delay(3000);
    ESP.restart();
  }
  
  // Connexion WiFi réussie
  Serial.println("Connexion WiFi établie !");
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());
  Serial.print("Adresse IP: ");
  Serial.println(WiFi.localIP());
  Serial.print("Adresse MAC: ");
  Serial.println(WiFi.macAddress());
  
  // Configuration mDNS
  Serial.println("Configuration mDNS...");
  if (MDNS.begin(MDNS_HOSTNAME)) {
    Serial.print("mDNS démarré avec le nom: ");
    Serial.print(MDNS_HOSTNAME);
    Serial.println(".local");
    Serial.println("Interface web accessible via: http://ksolotikontrol.local");
  } else {
    Serial.println("Erreur lors du démarrage mDNS");
  }
  
  // Ajouter le service HTTP
  MDNS.addService("http", "tcp", 80);
          
  // Configurer les routes du serveur web        
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave à 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("Début du chargement des presets web...");        
  loadWebPresets();
  
  // Initialiser les presets vides si aucun preset n'existe
  if (webPresetCount == 0) {
    Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
    initializeEmptyWebPresets();
  }
  
  Serial.println("Début du chargement des assignations web...");        
  loadWebAssignments();        
}        

// Initialisation du système de fichiers et du serveur web (Mode Point d'accès ESP)
void setupWebInterfaceESP() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      return;        
    }        
  }        
  Serial.println("LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println(" Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println(" Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
  // Configuration du point d'accès WiFi
  Serial.println("Configuration du point d'accès WiFi...");
  const char* apSSID = "KsolotiKontrol-AP";
  const char* apPassword = "ksoloti123";
  
  // Créer le point d'accès
  WiFi.softAP(apSSID, apPassword);
  
  // Obtenir l'adresse IP du point d'accès
  IPAddress apIP = WiFi.softAPIP();
  Serial.print("Point d'accès créé: ");
  Serial.println(apSSID);
  Serial.print("Adresse IP: ");
  Serial.println(apIP);
  Serial.print("Mot de passe: ");
  Serial.println(apPassword);
  
  // Configuration mDNS (optionnel pour le point d'accès)
  Serial.println("Configuration mDNS...");
  if (MDNS.begin(MDNS_HOSTNAME)) {
    Serial.print("mDNS démarré avec le nom: ");
    Serial.print(MDNS_HOSTNAME);
    Serial.println(".local");
    Serial.println("Interface web accessible via: http://ksolotikontrol.local");
  } else {
    Serial.println("Erreur lors du démarrage mDNS");
  }
  
  // Ajouter le service HTTP
  MDNS.addService("http", "tcp", 80);
          
  // Configurer les routes du serveur web        
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave à 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("Début du chargement des presets web...");        
  loadWebPresets();
  
