gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Initialiser les presets vides si aucun preset n'existe
  if (webPresetCount == 0) {
    Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
    initializeEmptyWebPresets();
  }
  
  Serial.println("Début du chargement des assignations web...");        
  loadWebAssignments();        
}        

// Configuration des routes du serveur web
void setupWebRoutes() {        
  // Route explicite pour la racine -> index.html
  webServer.on("/", HTTP_GET, []() {
    File file = LittleFS.open("/index.html", "r");
    if (file) {
      webServer.streamFile(file, "text/html");
      file.close();
    } else {
      webServer.send(404, "text/plain", "index.html not found");
    }
  });
          
  // Route de test simple (pour vérifier que le serveur fonctionne)        
  webServer.on("/test", HTTP_GET, []() {        
    String html = "<!DOCTYPE html><html><body>";        
    html += "<h1>Test DMX Controller</h1>";        
    html += "<p>Le serveur web fonctionne !</p>";        
    html += "<p>Fichiers LittleFS:</p><ul>";        
            
    File root = LittleFS.open("/");        
    File file = root.openNextFile();        
    while (file) {        
      html += "<li>" + String(file.name()) + " (" + String(file.size()) + " bytes)</li>";        
      file = root.openNextFile();        
    }        
    html += "</ul>";        
        
    html += "</body></html>";        
            
    webServer.send(200, "text/html", html);        
  });        
          
        
          
  // API pour récupérer les paramètres        
  webServer.on("/api/parameters", HTTP_GET, handleGetParameters);        
          
  // API pour mettre à jour un paramètre        
  webServer.on("/api/parameters", HTTP_POST, handleUpdateParameter);        
          
  // API pour récupérer les assignations        
  webServer.on("/api/assignments", HTTP_GET, handleGetAssignments);        
          
  // API pour mettre à jour les assignations        
  webServer.on("/api/assignments", HTTP_POST, handleUpdateAssignments);        
          
  // API pour sauvegarder un preset web        
  webServer.on("/api/save-preset", HTTP_POST, handleSaveWebPreset);        
          
  // API pour charger un preset web        
  webServer.on("/api/load-preset", HTTP_POST, handleLoadWebPreset);        
          
  // API pour lister les presets web        
  webServer.on("/api/presets", HTTP_GET, handleListWebPresets);        
          
  // API pour gérer les octaves        
  webServer.on("/api/octave", HTTP_POST, handleOctave);        
  
  // API pour exporter/importer les presets
  webServer.on("/api/export-presets", HTTP_GET, handleExportPresets);
  webServer.on("/api/import-presets", HTTP_POST, handleImportPresets);
  
  // API pour récupérer les messages de debug
  webServer.on("/api/debug", HTTP_GET, handleGetDebugMessages);
          
  // API pour vérifier les changements physiques - DÉSACTIVÉ (trop lourd)       
  // webServer.on("/api/status", HTTP_GET, handleGetStatus);        
          
  // Servir les fichiers statiques depuis LittleFS (APRÈS les APIs)        
  webServer.serveStatic("/", LittleFS, "/");        
          
  // Gestion des erreurs 404        
  webServer.onNotFound(handleNotFound);        
}        

// === FONCTIONS DE DEBUG WEB ===

// Fonction pour ajouter un message de debug
void addDebugMessage(String message) {
  // Ajouter un timestamp
  String timestamp = String(millis());
  String fullMessage = "[" + timestamp + "] " + message + "\n";
  
  // Ajouter le message au buffer
  debugMessages += fullMessage;
  
  // Limiter le nombre de messages pour éviter la surcharge mémoire
  int lineCount = 0;
  for (int i = 0; i < debugMessages.length(); i++) {
    if (debugMessages.charAt(i) == '\n') lineCount++;
  }
  
  // Si trop de messages, supprimer les plus anciens
  if (lineCount > MAX_DEBUG_MESSAGES) {
    int firstNewline = debugMessages.indexOf('\n');
    if (firstNewline != -1) {
      debugMessages = debugMessages.substring(firstNewline + 1);
    }
  }
}

// API pour récupérer les messages de debug
void handleGetDebugMessages() {
  DynamicJsonDocument doc(4096);
  doc["messages"] = debugMessages;
  doc["count"] = debugMessages.length();
  
  String response;
  serializeJson(doc, response);
  webServer.send(200, "application/json", response);
}        
        
// API: Récupérer le statut système        
void handleGetStatus() {        
  Serial.println("DEBUG: handleGetStatus() appelée");        
  DynamicJsonDocument doc(512);        
  doc["lastPhysicalPresetChange"] = lastPhysicalPresetChange;        
  doc["selectedWebPreset"] = selectedWebPreset;        
  doc["webOctave"] = webOctave;        
  doc["lastWebPreset"] = lastWebPreset;        
          
  String response;        
  serializeJson(doc, response);        
  Serial.println("DEBUG: Status response: " + response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Récupérer les paramètres        
void handleGetParameters() {        
  Serial.println("DEBUG: GET /api/parameters - Début");        
          
  DynamicJsonDocument doc(1024);        
  JsonArray paramsArray = doc.createNestedArray("parameters");        
          
  // Envoyer les 27 paramètres web (0-20: audio, 21-23: filter, 24-26: rgb1)        
  // Si on est en mode web (preset 0), utiliser les valeurs des paramètres        
  // Sinon, utiliser les valeurs du preset actuel        
  if (selectedPreset == 0) {        
    for (int i = 0; i < 27; i++) {        
      paramsArray.add(parameters[i].value);        
    }        
  } else {        
    for (int i = 0; i < 27; i++) {        
      paramsArray.add(presets[selectedPreset].values[i]);        
    }        
  }        
          
  String response;        
  serializeJson(doc, response);        
          
  Serial.println("DEBUG: GET /api/parameters - Réponse envoyée: " + response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Mettre à jour un paramètre        
void handleUpdateParameter() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
