gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    int id = doc["id"];        
    int value = doc["value"];        
            
    if (id >= 0 && id < 27 && value >= 0 && value <= 255) {        
      // Debug: Paramètre ID" + String(id) + " mis à jour
      parameters[id].value = value;        
      dmxValues[parameters[id].dmxChannel - 1] = value;        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Paramètre mis à jour";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Récupérer les assignations        
void handleGetAssignments() {        
  Serial.println("≡ƒöù GET /api/assignments - Début");        
          
  DynamicJsonDocument doc(512);        
  JsonArray assignmentsArray = doc.createNestedArray("assignments");        
          
  for (int i = 0; i < 4; i++) {        
    assignmentsArray.add(webAssignments[i]);        
  }        
          
  String response;        
  serializeJson(doc, response);        
          
  Serial.println("≡ƒöù GET /api/assignments - Réponse envoyée: " + response);        
  webServer.send(200, "application/json", response);        
}        
        

// API: Mettre à jour les assignations        
void handleUpdateAssignments() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int index = doc["index"];        
    int value = doc["value"];        
            
    if (index >= 0 && index < 4 && value >= 0 && value <= 23) {        
      webAssignments[index] = value;        
      saveWebAssignments();        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Assignation mise à jour";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Sauvegarder un preset web        
void handleSaveWebPreset() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(2048);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    const char* name = doc["name"];        
    JsonArray values = doc["values"];        
    JsonArray assignments = doc["assignments"];        
    int slot = doc["slot"]; // Nouveau : index du slot où sauvegarder        
            
    if (slot >= 0 && slot < MAX_WEB_PRESETS && values.size() == 27) {        
      strcpy(webPresets[slot].name, name);        
              
      for (int i = 0; i < 27; i++) {        
        webPresets[slot].values[i] = values[i];        
      }        
              
      // Sauvegarder l'octave web actuelle        
      webPresets[slot].octave = webOctave;        
              
      // Sauvegarder les assignations physiques reçues        
      if (assignments.size() == 4) {        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = assignments[i];        
        }        
      } else {        
        // Fallback : utiliser les assignations actuelles si pas reçues        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = webAssignments[i];        
        }        
      }        
              
      // Recalculer webPresetCount correctement (compter tous les presets avec un nom)
      webPresetCount = 0;
      for (int i = 0; i < MAX_WEB_PRESETS; i++) {
        if (strlen(webPresets[i].name) > 0) {
          webPresetCount++;
        }
      }
              
      saveWebPresets();        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Preset sauvegardé";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Slot invalide ou données incorretes\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Charger un preset web        
void handleLoadWebPreset() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int id = doc["id"];        
            
    // Vérifier que le slot existe et contient des données (on ignore webPresetCount)       
    if (id >= 0 && id < MAX_WEB_PRESETS && strlen(webPresets[id].name) > 0) {        
      // Debug: Chargement preset P" + String(id + 1)
      // Appliquer les valeurs du preset        
      for (int i = 0; i < 27; i++) {        
        parameters[i].value = webPresets[id].values[i];        
        dmxValues[parameters[i].dmxChannel - 1] = webPresets[id].values[i];        
      }        
              
      // Charger l'octave du preset        
      webOctave = webPresets[id].octave;        
              
      // Charger les assignations physiques du preset        
      for (int i = 0; i < 4; i++) {        
        webAssignments[i] = webPresets[id].assignments[i];        
      }        
              
