gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
      // Sauvegarder les assignations web mises à jour        
      saveWebAssignments();        
              
      // Appliquer l'octave aux paramètres sensibles        
      applyWebOctave();        
              
      // Mettre à jour l'affichage de l'octave        
      displayUnified();        
              
      lastWebPreset = id;        
              
      // Sauvegarder l'état dans le preset 0 pour persistance        
      saveWebStateToPreset0();        
              
      DynamicJsonDocument response(1024);        
      response["success"] = true;        
      response["message"] = "Preset chargé";        
              
      // Retourner les vraies valeurs des presets web (pas des paramètres actuels)        
      JsonArray paramsArray = response.createNestedArray("parameters");        
      for (int i = 0; i < 27; i++) {        
        paramsArray.add(webPresets[id].values[i]);        
      }        
              
      // Ajouter l'octave du preset chargé        
      response["octave"] = webPresets[id].octave;        
              
      // Ajouter les assignations du preset chargé        
      JsonArray assignmentsArray = response.createNestedArray("assignments");        
      for (int i = 0; i < 4; i++) {        
        assignmentsArray.add(webPresets[id].assignments[i]);        
      }        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Preset non trouvé ou slot vide\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Lister les presets web        
void handleListWebPresets() {        
  DynamicJsonDocument doc(2048);        
  JsonArray presetsArray = doc.createNestedArray("presets");        
          
  // Parcourir TOUS les slots (0-7) et vérifier lesquels ont un nom
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    if (strlen(webPresets[i].name) > 0) {  // Seulement les presets avec un nom
      JsonObject preset = presetsArray.createNestedObject();        
      preset["name"] = webPresets[i].name;        
      preset["id"] = i;        
    }
  }        
          
  String response;        
  serializeJson(doc, response);        
  webServer.send(200, "application/json", response);        
}        
        

// API: Gérer les octaves        
void handleOctave() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    String direction = doc["direction"];        
            
    if (direction == "up" && webOctave < 12) {        
      webOctave++;        
    } else if (direction == "down" && webOctave > -12) {        
      webOctave--;        
    }        
            
    // Appliquer l'octave web directement (système séparé)        
    applyWebOctave();        
            
    // Afficher l'octave sur l'écran (utiliser webOctave au lieu de transpose)        
    if (selectedPreset == 0 && webModeActive) {        
      displayUnified();        
              
      Serial.print("🎵 Octave web mise à jour: ");        
      Serial.println(webOctave);        
    }        
            
    DynamicJsonDocument response(256);        
    response["success"] = true;        
    response["octave"] = webOctave;        
    response["message"] = "Octave mise à jour";        
            
    String responseStr;        
    serializeJson(response, responseStr);        
    webServer.send(200, "application/json", responseStr);        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// Gestion des erreurs 404        
void handleNotFound() {        
  String path = webServer.uri();        
  Serial.print(" 404 - Page non trouvée: ");        
  Serial.println(path);        
          
  // Vérifier si le fichier existe dans LittleFS et le servir        
  if (LittleFS.exists(path)) {        
    Serial.println("  ⚠️ Le fichier existe dans LittleFS, tentative de service...");        
    
    File file = LittleFS.open(path, "r");        
    if (file) {        
      // Déterminer le type MIME        
      String mimeType = "text/plain";        
      if (path.endsWith(".html")) mimeType = "text/html";        
      else if (path.endsWith(".css")) mimeType = "text/css";        
      else if (path.endsWith(".js")) mimeType = "application/javascript";        
      else if (path.endsWith(".json")) mimeType = "application/json";        
      else if (path.endsWith(".png")) mimeType = "image/png";        
      else if (path.endsWith(".jpg") || path.endsWith(".jpeg")) mimeType = "image/jpeg";        
          
      webServer.streamFile(file, mimeType);        
      file.close();        
      Serial.println("  ✅ Fichier servi avec succès");        
    } else {        
      Serial.println("  ❌ Impossible d'ouvrir le fichier");        
      webServer.send(500, "text/plain", "Erreur serveur");        
    }        
  } else {        
    Serial.println("   Le fichier n'existe pas dans LittleFS");        
    webServer.send(404, "text/plain", "Fichier non trouvé");        
  }        
}        
        
        
        
        
// Sauvegarde des presets web dans LittleFS        
void saveWebPresets() {        
  Serial.println("=== DEBUG SAUVEGARDE PRESETS ===");
  
  // Afficher d'abord ce qui est en mémoire
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    Serial.print("Slot ");
    Serial.print(i);
    Serial.print(" en mémoire: ");
    if (strlen(webPresets[i].name) > 0) {        
      Serial.print("\"");
      Serial.print(webPresets[i].name);        
      Serial.println("\" ✓");
    } else {        
      Serial.println("VIDE");
    }        
  }
  
  File file = LittleFS.open("/web_presets.json", "w");        
  if (file) {        
    DynamicJsonDocument doc(8192);  // Augmenter aussi le buffer de sauvegarde        
    JsonArray presetsArray = doc.createNestedArray("presets");        
    
    int savedCount = 0;
            
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
      // Sauvegarder seulement les slots qui contiennent des données        
      if (strlen(webPresets[i].name) > 0) {        
        Serial.print("Sauvegarde du slot ");
        Serial.print(i);
        Serial.print(": ");
        Serial.println(webPresets[i].name);
        
        JsonObject preset = presetsArray.createNestedObject();        
        preset["slot"] = i;  // Sauvegarder le numéro de slot        
        preset["name"] = webPresets[i].name;        
        preset["octave"] = webPresets[i].octave; // Sauvegarder l'octave        
                
