gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
        JsonArray valuesArray = preset.createNestedArray("values");        
        for (int j = 0; j < 27; j++) {        
          valuesArray.add(webPresets[i].values[j]);        
        }        
                
        // Sauvegarder les assignations physiques        
        JsonArray assignmentsArray = preset.createNestedArray("assignments");        
        for (int j = 0; j < 4; j++) {        
          assignmentsArray.add(webPresets[i].assignments[j]);        
        }
        
        savedCount++;        
      }        
    }        
            
    // Debug: vérifier la taille du JSON généré
    size_t jsonSize = measureJson(doc);
    Serial.print("DEBUG: Taille du JSON généré: ");
    Serial.print(jsonSize);
    Serial.println(" bytes");
    
    size_t bytesWritten = serializeJson(doc, file);        
    file.close();        
    
    Serial.print("✅ ");
    Serial.print(savedCount);
    Serial.print(" presets web sauvegardés dans le fichier (");
    Serial.print(bytesWritten);
    Serial.println(" bytes écrits)");        
  } else {
    Serial.println("❌ Erreur: impossible d'ouvrir le fichier pour sauvegarde");
  }
  Serial.println("===============================");        
}        
        
// Chargement des presets web depuis LittleFS        
void loadWebPresets() {        
  Serial.println("DEBUG: Entrée dans loadWebPresets()");        
          
  // Vérifier d'abord si le fichier existe        
  Serial.println("DEBUG: Vérification de l'existence du fichier...");        
  bool fileExists = LittleFS.exists("/web_presets.json");        
  Serial.print("DEBUG: LittleFS.exists() retourne: ");        
  Serial.println(fileExists ? "TRUE" : "FALSE");        
          
  if (!fileExists) {        
    Serial.println("ℹ️ Aucun preset web trouvé (première utilisation)");        
    webPresetCount = 0;        
    Serial.println("DEBUG: Sortie de loadWebPresets() - fichier n'existe pas");        
    return;        
  }        
          
  Serial.println("DEBUG: Fichier existe, tentative d'ouverture...");        
  File file = LittleFS.open("/web_presets.json", "r");        
  Serial.println("DEBUG: Après appel LittleFS.open()");        
          
  if (file) {        
    Serial.println("DEBUG: Fichier ouvert avec succès");        
    DynamicJsonDocument doc(8192);  // Doubler la taille pour 8 presets complets      
    DeserializationError error = deserializeJson(doc, file);
    
    if (error) {
      Serial.print("❌ Erreur parsing JSON: ");
      Serial.println(error.c_str());
      file.close();
      return;
    }        
            
    JsonArray presetsArray = doc["presets"];        
    
    // DEBUG: Afficher combien de presets sont dans le JSON
    Serial.print("DEBUG: Nombre de presets trouvés dans le JSON: ");
    Serial.println(presetsArray.size());
    
    // D'abord vider tous les noms pour éviter les résidus
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {
      webPresets[i].name[0] = '\0';  // Vider le nom
    }
            
    for (JsonObject preset : presetsArray) {
      int slot = preset["slot"];
      const char* name = preset["name"];
      Serial.print("DEBUG: Traitement preset JSON slot ");
      Serial.print(slot);
      Serial.print(", nom: ");
      Serial.println(name ? name : "NULL");        
              
      if (slot >= 0 && slot < MAX_WEB_PRESETS) {        
        strcpy(webPresets[slot].name, preset["name"]);        
                
        // Charger l'octave (défaut à 0 si pas présent pour compatibilité)        
        webPresets[slot].octave = preset["octave"] | 0;        
                
        JsonArray valuesArray = preset["values"];        
        int i = 0;        
        for (JsonVariant value : valuesArray) {        
          if (i < 27) {        
            webPresets[slot].values[i] = value;        
            i++;        
          }        
        }        
                
        // Charger les assignations physiques (défaut à 0 si pas présent pour compatibilité)        
        if (preset.containsKey("assignments")) {        
          JsonArray assignmentsArray = preset["assignments"];        
          int j = 0;        
          for (JsonVariant assignment : assignmentsArray) {        
            if (j < 4) {        
              webPresets[slot].assignments[j] = assignment | 0;        
              j++;        
            }        
          }        
        } else {        
          // Compatibilité avec les anciens presets : initialiser les assignations à 0        
          for (int j = 0; j < 4; j++) {        
            webPresets[slot].assignments[j] = 0;        
          }        
        }        
      }        
    }
    
    // Recalculer webPresetCount en comptant tous les presets avec un nom
    webPresetCount = 0;
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {
      if (strlen(webPresets[i].name) > 0) {
        webPresetCount++;
      }
    }        
            
    // Debug détaillé - afficher tous les presets trouvés
    Serial.println("=== DEBUG PRESETS CHARGÉS ===");
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {
      Serial.print("Slot ");
      Serial.print(i);
      Serial.print(": ");
      if (strlen(webPresets[i].name) > 0) {
        Serial.print("\"");
        Serial.print(webPresets[i].name);
        Serial.println("\" ✓");
      } else {
        Serial.println("VIDE");
      }
    }
    Serial.println("=============================");
    
    Serial.print("✅ ");        
    Serial.print(webPresetCount);        
    Serial.println(" presets web chargés");        
  } else {        
    Serial.println("DEBUG: Impossible d'ouvrir le fichier");        
  }        
  Serial.println("DEBUG: Sortie de loadWebPresets()");        
}        
        
// Sauvegarde des assignations dans LittleFS        
void saveWebAssignments() {        
  File file = LittleFS.open("/web_assignments.json", "w");        
  if (file) {        
    DynamicJsonDocument doc(512);        
    JsonArray assignmentsArray = doc.createNestedArray("assignments");        
            
